# 作者：李帅宇    时间 : 2022/1/25
year = 2010
print("鱼c工作室成立于year年")
print("鱼c工作室成立于{}年".format(year))
"1 + 2 = {}, 2的平方是{}".format(1 + 2, 2 * 2)
"{}看到{}就很激动".format("小甲鱼", "漂亮的小姐姐")
"{1}看到{0}就很激动".format("小甲鱼", "漂亮的小姐姐")
"{0}{1}{1}{0}".format("是", "非")
"我叫{name}, 我爱{fav}".format(name="小甲鱼", fav="Python")
"我叫{name}, 我爱{0}，喜欢{0}的人，运气都不会太差".format("Python", name="小甲鱼")
"{}{}{}".format(1, "{}", 2)
"{}{{}}{}".format(1, 2)
"{:^}".format(250)
"{:^10}".format(250)
"{1:>10}{0:<10}".format(520, 250)
"{left:>10}{right:<10}".format(left=520, right=250)
# <强制字符串在空间内左对齐
# > 强制字符串在空间内右对齐
# = 强制填充放置在符号（如果有）之后但是在数字之前的位置
# ^ 强制字符串在可用空间内居中
"{:010}".format(520)
"{:0=10}".format(520)
"{:0=10}".format(-520)
"{1:%>10}{0:#<10}".format(250, 520)
# 符号的用法
"{:+}{:-}".format(250, -520)
"{:,}".format(1234)  # 如果位数不足，千分位的分隔符是不显示的
"{:_}".format(1234)
"{:,}".format(123456789)
# 对于[type]设置为"f""F"的浮点数来说，是限定小数点后显示多少个数位
# 对于[type]设置为"g""G"的浮点数来说，是限定小数点前后一共显示多少个数位
# 对于非数字类型，限定最大字段的大小
# 对于整数类型来说，不允许使用[.prscision]选项
"{:.2f}".format(3.1415)
"{:.2g}".format(3.1415)
"{:.6}".format("i love fish")
"{:b}".format(80)
# "b", 将参数以二进制形式输出
# "c", 将参数以Unicode形式输出
# "d", 将参数以十进制形式输出
# "o", 将参数以八进制形式输出
# "x", 将参数以十六进制形式输出
# "X", 将参数以十六进制形式输出
# "n", 和"d"类似，不同之处在于他会使用当前语言环境设置的分隔符插入到恰当位置
# None, 和"d"一样
"{:b}".format(80)
"{:#b}".format(80)
# "e", "E"将参数以科学记数法的形式表示出来，默认精度为6位
"{:e}".format(3.14)
# "f", 将参数以定点表示法的形式表示出来（不是数用"nan"表示，无穷用"inf"表示）
# 'g', 通用格式，小数用"f"形式输出，大数以"e"形式输出
"{:g}".format(1234567)
"{:g}".format(1234)
# "%", 以百分比的形式输出，（将数字×100并显示为定点表示法"f"的形式，后面加%）
"{:%}".format(0.98)
"{:.2%}".format(0.98)
"{:.{prec}f}".format(3.1415, prec=2)  # 通过关键字参数设置选项的值

 # f-字符串
year = 2010
"鱼c工作室成立于year年"
"鱼c工作室成立于{}年".format(year)
F"鱼c工作室成立于{2010}年"
F"1 + 2 = {3}, 2的平方是{4}"
F"{123456789:,}"